entries/get-current-stack-size-in-racket/index.html
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <title>SICP & Getting the Size of the Current "Stack" in Racket</title>
    <meta name="viewport" content="width=device-width">
    <meta name="description" content="My personal place to write about the things I find interesting. Programming, Lisp, Ruby, Emacs, etc.">
    <link rel="canonical" href="http://joelmccracken.github.io/entries/get-current-stack-size-in-racket/">

    <!-- Custom CSS -->
    <link rel="stylesheet" href="/css/main.css">

</head>

    <body>

    <header class="site-header">

  <div class="wrap">

    <a class="site-title" href="/">Joel's Journal</a>

    <nav class="site-nav">
      <a href="#" class="menu-icon">
        <svg version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
           viewBox="0 0 18 15" enable-background="new 0 0 18 15" xml:space="preserve">
          <path fill="#505050" d="M18,1.484c0,0.82-0.665,1.484-1.484,1.484H1.484C0.665,2.969,0,2.304,0,1.484l0,0C0,0.665,0.665,0,1.484,0
            h15.031C17.335,0,18,0.665,18,1.484L18,1.484z"/>
          <path fill="#505050" d="M18,7.516C18,8.335,17.335,9,16.516,9H1.484C0.665,9,0,8.335,0,7.516l0,0c0-0.82,0.665-1.484,1.484-1.484
            h15.031C17.335,6.031,18,6.696,18,7.516L18,7.516z"/>
          <path fill="#505050" d="M18,13.516C18,14.335,17.335,15,16.516,15H1.484C0.665,15,0,14.335,0,13.516l0,0
            c0-0.82,0.665-1.484,1.484-1.484h15.031C17.335,12.031,18,12.696,18,13.516L18,13.516z"/>
        </svg>
      </a>
      <div class="trigger">
        <a class="page-link" href="/about">About</a>
        <a class="page-link" href="/projects">Projects</a>
      </div>
    </nav>

  </div>

</header>

    <div class="page-content">
      <div class="wrap">
      <div class="post">

  <header class="post-header">
    <h1>SICP & Getting the Size of the Current "Stack" in Racket</h1>
    <p class="meta">Dec 6, 2014</p>
  </header>

  <article class="post-content">
  <p>
I've been working through <i>SICP<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup></i> again. Its really a great book &#x2013;
and I need to say more about it on here sometime.
</p>

<p>
I am currently on Exercise 1.11, which centers around writing two
separate functions that both compute a mathematical function. The
first function should compute in
a <i>recursive</i> way and the second should compute in a
<i>iterative</i> way.
</p>

<p>
The point of writing the function in these different ways is to
highlight the fact that iterative formulations are fast and take
up significantly less memory; in fact, they can be computed
in place/in constant space.
</p>

<p>
While I was wrote these, it hit me: It's interesting to create these
functions, but it would be even more interesting to show that the
computations take up the amount of space we have predicted. So, I set
out to see if I could
figure out how to get current size of the stack, and then to watch the
stack change during the course of both executions.
</p>

<p>
As it turns out, it doesn't seem like Racket has the direct concept of
a stack. This doesn't surprise me, because I understand that the
concept of a stack is a little bit less clear-cut in languages that
support continuations &amp; tail call optimization.
</p>

<p>
However, I was able to find a method <a href="http://docs.racket-lang.org/reference/runtime.html#(def._((quote._~23~25kernel)._vector-set-performance-stats!))"><code>vector-set-performance-stats!</code></a>
that will provide "the number of bytes currently in use for the
thread's continuation". Since a continuation represents the remaining
work that a thread needs to perform as part of its computation, it
seems like this would map fairly directly to the idea of the stack
size showing how each function grows in space during the
computation. If the recursive continuation size
continually grows, and the iterative continuation size stays
constant, that would be strong evidence that this would be answering
my question.
</p>

<p>
Measurements of the stack size performed as predicted. During the
course of the execution, the recursive continuation size kept
growing. Surprisingly, the iterative version kept <b>precisely the
same</b>. I wasn't certain at the time that this would be the case, but
to me, this clearly is a success.
</p>

<p>
Ok, so how we measure the size of the continuation? The function  <code>get-continuation-size</code>
below finds the information for us.
</p>

<div class="org-src-container">

<pre class="src src-scheme">(define (get-continuation-size)
  (let ((results (make-vector 20)))
    (vector-set-performance-stats! results (current-thread))
    ;; item 3 contains continuation size
    (vector-ref results 3)))
</pre>
</div>

<p>
I'm going to keep using this code to show exactly the same thing &#x2013;
that functions are executing within the space we expect them to.
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
: <a href="http://mitpress.mit.edu/sicp/full-text/book/book.html">http://mitpress.mit.edu/sicp/full-text/book/book.html</a>
</p></div>


</div>
</div>
  </article>

  <div id="disqus_thread" style="margin: 3em;"></div>
  <script type="text/javascript">
   /* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
   var disqus_shortname = 'joelmccracken'; // required: replace example with your forum shortname

   /* * * DON'T EDIT BELOW THIS LINE * * */
   (function() {
     var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
     dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
     (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
   })();
  </script>
</div>

      </div>
    </div>

    <footer class="site-footer">

  <div class="wrap">

    <h2 class="footer-heading">Joel McCracken</h2>

    <div class="footer-col-1 column">
      <ul>
        <li><a href="mailto:mccracken.joel@gmail.com">mccracken.joel@gmail.com</a></li>
      </ul>
    </div>

    <div class="footer-col-2 column">
      <ul>
        <li>
          <a href="https://github.com/JoelMcCracken">
            <span class="icon github">
              <svg version="1.1" class="github-icon-svg" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
                 viewBox="0 0 16 16" enable-background="new 0 0 16 16" xml:space="preserve">
                <path fill-rule="evenodd" clip-rule="evenodd" fill="#C2C2C2" d="M7.999,0.431c-4.285,0-7.76,3.474-7.76,7.761
                c0,3.428,2.223,6.337,5.307,7.363c0.388,0.071,0.53-0.168,0.53-0.374c0-0.184-0.007-0.672-0.01-1.32
                c-2.159,0.469-2.614-1.04-2.614-1.04c-0.353-0.896-0.862-1.135-0.862-1.135c-0.705-0.481,0.053-0.472,0.053-0.472
                c0.779,0.055,1.189,0.8,1.189,0.8c0.692,1.186,1.816,0.843,2.258,0.645c0.071-0.502,0.271-0.843,0.493-1.037
                C4.86,11.425,3.049,10.76,3.049,7.786c0-0.847,0.302-1.54,0.799-2.082C3.768,5.507,3.501,4.718,3.924,3.65
                c0,0,0.652-0.209,2.134,0.796C6.677,4.273,7.34,4.187,8,4.184c0.659,0.003,1.323,0.089,1.943,0.261
                c1.482-1.004,2.132-0.796,2.132-0.796c0.423,1.068,0.157,1.857,0.077,2.054c0.497,0.542,0.798,1.235,0.798,2.082
                c0,2.981-1.814,3.637-3.543,3.829c0.279,0.24,0.527,0.713,0.527,1.437c0,1.037-0.01,1.874-0.01,2.129
                c0,0.208,0.14,0.449,0.534,0.373c3.081-1.028,5.302-3.935,5.302-7.362C15.76,3.906,12.285,0.431,7.999,0.431z"/>
              </svg>
            </span>
            <span class="username">JoelMcCracken</span>
          </a>
        </li>
        <li>
          <a href="https://twitter.com/JoelMcCracken">
            <span class="icon twitter">
              <svg version="1.1" class="twitter-icon-svg" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
                 viewBox="0 0 16 16" enable-background="new 0 0 16 16" xml:space="preserve">
                <path fill="#C2C2C2" d="M15.969,3.058c-0.586,0.26-1.217,0.436-1.878,0.515c0.675-0.405,1.194-1.045,1.438-1.809
                c-0.632,0.375-1.332,0.647-2.076,0.793c-0.596-0.636-1.446-1.033-2.387-1.033c-1.806,0-3.27,1.464-3.27,3.27
                c0,0.256,0.029,0.506,0.085,0.745C5.163,5.404,2.753,4.102,1.14,2.124C0.859,2.607,0.698,3.168,0.698,3.767
                c0,1.134,0.577,2.135,1.455,2.722C1.616,6.472,1.112,6.325,0.671,6.08c0,0.014,0,0.027,0,0.041c0,1.584,1.127,2.906,2.623,3.206
                C3.02,9.402,2.731,9.442,2.433,9.442c-0.211,0-0.416-0.021-0.615-0.059c0.416,1.299,1.624,2.245,3.055,2.271
                c-1.119,0.877-2.529,1.4-4.061,1.4c-0.264,0-0.524-0.015-0.78-0.046c1.447,0.928,3.166,1.469,5.013,1.469
                c6.015,0,9.304-4.983,9.304-9.304c0-0.142-0.003-0.283-0.009-0.423C14.976,4.29,15.531,3.714,15.969,3.058z"/>
              </svg>
            </span>
            <span class="username">JoelMcCracken</span>
          </a>
        </li>
      </ul>
    </div>

    <!-- 
    <div class="footer-col-3 column">
      <p class="text">would like to add some rotating content down here</p>
    </div>
    -->
  </div>

</footer>


    <script type="text/javascript">
 var _gaq = _gaq || [];
 _gaq.push(['_setAccount', 'UA-7759066-1']);
 _gaq.push(['_trackPageview']);

 (function() {
   var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
   ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
   var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
 })();
</script>

    </body>
</html>
